# MaximumColumnWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..MaximumColumnWidth Property
TableView Class See Also
---
Gets the maximum column width
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int MaximumColumnWidth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaximumColumnWidth As Integer
	Get
```

Visual C++
---
```text
public:
property int MaximumColumnWidth {
	int get ();
}
```

# See Also
TableView Class
Autodesk.Revit.DB Namespace